---
type: AnalyticalPowerSourceData
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 2
tags: [revit-api, class]
---

# AnalyticalPowerSourceData

`Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | TotalConnectedCurrent | 2023 | `public double TotalConnectedCurrent { get ; }` |
| Property | Voltage | 2023 | `public double Voltage { get ; set ; }` |